000_РОЗНИЦА_ЦЕНТР/src/Documents/СрокиРеализации/СрокиРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СрокиРеализации</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПродажиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПродажиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриходаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриходаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриходаС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриходаПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрихода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсталосьДнейДоКонцаСрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Documents/СрокиРеализации/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////
// Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная",
				"Накладная",
				ПечатьНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыВывода),,,Истина)
		
	КонецЕсли;
	
КонецПроцедуры




Функция ПечатьНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	А = 0;	
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	//КодЯзыкаПечать = "uk";
	КолонкаКодов       = ФормированиеПечатныхФормСервер.ИмяДополнительнойКолонки();
	ВыводитьУпаковки   = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	ТабличныйДокумент  = Новый ТабличныйДокумент;
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	СинонимДокумента   = НСтр("ru='Счет на оплату';uk='Рахунок на оплату'", КодЯзыкаПечать);
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НН";
	
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СрокиРеализацииТовары.Номенклатура КАК Номенклатура,
		|	СрокиРеализацииТовары.Номенклатура.IDN КАК IDN,
		|	СрокиРеализацииТовары.Номенклатура.Производитель КАК Производитель,
		|	СрокиРеализацииТовары.СрокГодности КАК СрокГодности,
		|	СУММА(СрокиРеализацииТовары.КоличествоОтстаток) КАК КоличествоОтстаток,
		|	СУММА(СрокиРеализацииТовары.КоличествоПродажи) КАК КоличествоПродажи,
		|	СрокиРеализацииТовары.Цена КАК Цена,
		|	СрокиРеализацииТовары.ДатаПрихода КАК ДатаПрихода
		|ИЗ
		|	Документ.СрокиРеализации.Товары КАК СрокиРеализацииТовары
		|ГДЕ
		|	СрокиРеализацииТовары.Ссылка = &МассивОбъектов
		|
		|СГРУППИРОВАТЬ ПО
		|	СрокиРеализацииТовары.Номенклатура,
		|	СрокиРеализацииТовары.СрокГодности,
		|	СрокиРеализацииТовары.Цена,
		|	СрокиРеализацииТовары.Номенклатура.Производитель,
		|	СрокиРеализацииТовары.Номенклатура.IDN,
		|	СрокиРеализацииТовары.ДатаПрихода";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таб = РезультатЗапроса.ВЫгрузить();
	
	
Макет = УправлениеПечатью.ПолучитьМакет("Документ.СрокиРеализации.Накладная", КодЯзыкаПечать);
Область = Макет.ПолучитьОбласть("ОбластьЗаголовок");

ТабРеквезиты = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(МассивОбъектов,"ДатаФормирования,Ответственный,Магазин");

Область.Параметры.ДатаФормирования = ТабРеквезиты.ДатаФормирования;
Область.Параметры.Ответственный = ТабРеквезиты.Ответственный;
Область.Параметры.Магазин = ТабРеквезиты.Магазин;
ТабличныйДокумент.Вывести(Область);

Область = Макет.ПолучитьОбласть("ОбластьСтрока");

Для Каждого СтрСостава Из Таб Цикл 
	А = А + 1;
    Область.Параметры.Заполнить(СтрСостава);
	Область.Параметры.НомерПП = А;	
    ТабличныйДокумент.Вывести(Область); 
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;	
КонецЦикла;

//Область = Макет.ПолучитьОбласть("ОбластьИтог");
//Область.Параметры.КоличествоИтого = Таб.Итог("Количество");
//Область.Параметры.СуммаИтого = Таб.Итог("Сумма");
//Область.Параметры.СуммаНДСИтого = Таб.Итог("СуммаНДС");

//ТабличныйДокумент.Вывести(Область);
	
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, МассивОбъектов);
		
	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
